[
  {
    "text": "Setiap hari adalah kesempatan baru untuk menjadi versi terbaik dari diri Anda.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Kekuatan sejati datang dari kemampuan mengendalikan diri sendiri.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Recovery bukan tentang kesempurnaan, tapi tentang kemajuan yang konsisten.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Saat Anda merasa lemah, ingatlah bahwa Anda sudah terbukti kuat sampai sejauh ini.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Otak Anda sedang healing. Beri waktu dan kesabaran pada prosesnya.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Discipline is choosing between what you want now and what you want most.",
    "author": "Abraham Lincoln"
  },
  {
    "text": "The only impossible journey is the one you never begin.",
    "author": "Tony Robbins"
  },
  {
    "text": "Success is not final, failure is not fatal: it is the courage to continue that counts.",
    "author": "Winston Churchill"
  },
  {
    "text": "You are not your urges. You are the observer of your urges.",
    "author": "Recovery Wisdom"
  },
  {
    "text": "Every moment of resistance makes you stronger than before.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Your future self is counting on the decisions you make today.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Progress, not perfection. Growth, not guilt.",
    "author": "Recovery Principles"
  },
  {
    "text": "The cave you fear to enter holds the treasure you seek.",
    "author": "Joseph Campbell"
  },
  {
    "text": "Strength doesn't come from what you can do. It comes from overcoming the things you once thought you couldn't.",
    "author": "Rikki Rogers"
  },
  {
    "text": "You have been assigned this mountain to show others it can be moved.",
    "author": "Mel Robbins"
  },
  {
    "text": "Recovery adalah hadiah yang Anda berikan untuk diri sendiri setiap hari.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Kebiasaan buruk dilawan bukan dengan kemauan, tapi dengan kebiasaan yang lebih baik.",
    "author": "Recovery Science"
  },
  {
    "text": "Setiap 'tidak' yang Anda katakan pada urge adalah 'ya' untuk kehidupan yang lebih baik.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Neuroplasticity adalah bukti bahwa Anda tidak terjebak selamanya. Otak bisa berubah.",
    "author": "Neuroscience Facts"
  },
  {
    "text": "Addiction thrives in secrecy and shame. Recovery thrives in openness and support.",
    "author": "Recovery Community"
  },
  {
    "text": "You are rewiring your brain one choice at a time.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "The pain of discipline weighs ounces; the pain of regret weighs tons.",
    "author": "Jim Rohn"
  },
  {
    "text": "Your streak is not just a number. It's proof of your commitment to yourself.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Recovery mengajarkan Anda bahwa Anda lebih kuat dari keadaan tersulit sekalipun.",
    "author": "PMO Recovery Coach"
  },
  {
    "text": "Champions are made from something deep inside them: a desire, a dream, a vision.",
    "author": "Muhammad Ali"
  }
]
